% a1C2:此程序的目的是为了对数据进行挑选

%% 初始化
clear ;
close all;
clc;

%% 开始计算时间点0
tStart0 = tic;

%% 数据读取
u1 = xlsread('a1E1.xlsx','a2','A2:A22002');                                      % x1 为读取的横坐标序列
v1 = xlsread('a1E1.xlsx','a2','B2:B22002');                                      % y1 为读取的水平力数值

u2 = xlsread('a1E1.xlsx','a3','A2:A40002');                                      % x1 为读取的横坐标序列
v2 = xlsread('a1E1.xlsx','a3','B2:B40002');                                      % y1 为读取的水平力数值

%% 参数的设定
n1 = length(u1);                                                              % n1 为样本点的个数
m1 = 1;                                                                       % 选取样本点的间隔
i1 = 1:m1:n1;                                                                 % 抽选间隔的样本点
r1 = length(i1);                                                              % 找出抽取的样本的长度
x1 = 1:1:r1;                                                                  % 列出图像的 x 轴的数值
y1 = v1(i1);                                                                  % 列出图像的 y 轴的数值
a1u = min(x1);                                                                % a1 散点图的横坐标的最小值
a1d = max(x1);                                                                % a2 散点图的横坐标的最大值
b1u = min(y1);                                                                % b1 散点图的纵坐标的最小值
b1d = max(y1);                                                                % b2 散点图的纵坐标的最大值
c1x = n1/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c1y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

n2 = length(u2);                                                             % n1 为样本点的个数
m2 = 1;                                                                       % 选取样本点的间隔
i2 = 1:m2:n2;                                                                 % 抽选间隔的样本点
r2 = length(i2);                                                              % 找出抽取的样本的长度
x2 = 1:1:r2;                                                                  % 列出图像的 x 轴的数值
y2 = v2(i2);                                                                  % 列出图像的 y 轴的数值
a2u = min(x2);                                                                % a1 散点图的横坐标的最小值
a2d = max(x2);                                                                % a2 散点图的横坐标的最大值
b2u = min(y2);                                                                % b1 散点图的纵坐标的最小值
b2d = max(y2);                                                                % b2 散点图的纵坐标的最大值
c2x = n2/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c2y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

%% 画出图形
% 
f1 = figure;
subplot(2,1,1);
p1a = plot(x1,y1,'-r','Linewidth',1);                                       % 画出原始图形的线条 L1
axis([a1u-c1x,a1d+c1x,b1u-c1y,b1d+c1y]);
title('58000-80000的数据曲线','color','b');                                  % 图像的标题

subplot(2,1,2);
p1b = plot(x2,y2,'-m','Linewidth',1);                                        % 画出离群值处理后的线条 L2
axis([a2u-c2x,a2d+c2x,b2u-c2y,b2d+c2y]);
title('50000-9000的数据曲线','color','b');                                    % 图像的标题

%% 设置结束计算时间点0                                                         
tEnd0 = toc(tStart0); 

%% 计时结果输出
disp(' ');
disp('************************************************************');
disp('计时结果输出：');
fprintf('总共用时 ：%d 分 , %f 秒', floor(tEnd0/60), rem(tEnd0,60));            % 程序的总用时间
