% a1C6:此程序的目的是为了对数据进行等距抽样处理

%% 初始化
clear ;
close all;
clc;

%% 开始计算时间点0
tStart0 = tic;

%% 数据读取
load('C5d1.mat','u1','v1','h1','h2');                                         % 读取储存的变量

%% 参数的设定                     
% 全局变量
m1 = 50;
m2 = 100;
m3 = 200;
m4 = 400;
n = length(u1);                                                               % n1 为样本点的个数
t = h1;

% 局部变量
i1 = 1:m1:n;                                                                  % 抽选间隔的样本点
r1 = length(i1);                                                              % 找出抽取的样本的长度
x1 = 1:1:r1;                                                                  % 列出图像的 x 轴的数值
y1 = t(i1);                                                                   % 列出图像的 y 轴的数值
a1u = min(x1);                                                                % a1 散点图的横坐标的最小值
a1d = max(x1);                                                                % a2 散点图的横坐标的最大值
b1u = min(y1);                                                                % b1 散点图的纵坐标的最小值
b1d = max(y1);                                                                % b2 散点图的纵坐标的最大值
c1x = r1/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c1y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

i2 = 1:m2:n;                                                                  % 抽选间隔的样本点
r2 = length(i2);                                                              % 找出抽取的样本的长度
x2 = 1:1:r2;                                                                  % 列出图像的 x 轴的数值
y2 = t(i2);                                                                   % 列出图像的 y 轴的数值
a2u = min(x2);                                                                % a1 散点图的横坐标的最小值
a2d = max(x2);                                                                % a2 散点图的横坐标的最大值
b2u = min(y2);                                                                % b1 散点图的纵坐标的最小值
b2d = max(y2);                                                                % b2 散点图的纵坐标的最大值
c2x = r2/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c2y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

i3 = 1:m3:n;                                                                  % 抽选间隔的样本点
r3 = length(i3);                                                              % 找出抽取的样本的长度
x3 = 1:1:r3;                                                                  % 列出图像的 x 轴的数值
y3 = t(i3);                                                                   % 列出图像的 y 轴的数值
a3u = min(x3);                                                                % a1 散点图的横坐标的最小值
a3d = max(x3);                                                                % a2 散点图的横坐标的最大值
b3u = min(y3);                                                                % b1 散点图的纵坐标的最小值
b3d = max(y3);                                                                % b2 散点图的纵坐标的最大值
c3x = r3/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c3y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

i4 = 1:m4:n;                                                                  % 抽选间隔的样本点
r4 = length(i4);                                                              % 找出抽取的样本的长度
x4 = 1:1:r4;                                                                  % 列出图像的 x 轴的数值
y4 = t(i4);                                                                   % 列出图像的 y 轴的数值
a4u = min(x4);                                                                % a1 散点图的横坐标的最小值
a4d = max(x4);                                                                % a2 散点图的横坐标的最大值
b4u = min(y4);                                                                % b1 散点图的纵坐标的最小值
b4d = max(y4);                                                                % b2 散点图的纵坐标的最大值
c4x = r4/10;                                                                  % c1 为图像 x 坐标轴的前后的间隔
c4y = 10;                                                                     % c2 为图像 y 坐标轴的前后的间隔

%% 对数据进行分段处理
f1 = figure;
subplot(2,1,1);
p1a = plot(x1,y1,'-r','Linewidth',1);                                         % 画出滤波处理后的图像
axis([a1u-c1x,a1d+c1x,b1u-c1y,b1d+c1y]);                                      % 图形的坐标轴范围
title('样本数为800的曲线','color','b');                                        % 图像的标题  

subplot(2,1,2);
p1b = plot(x2,y2,'-r','Linewidth',1);                                         % 画出滤波处理后的图像
axis([a2u-c2x,a2d+c2x,b2u-c2y,b2d+c2y]);                                      % 图形的坐标轴范围
title('样本数为400的曲线','color','b');                                        % 图像的标题  

f2 = figure;
subplot(2,1,1);
p2a = plot(x3,y3,'-r','Linewidth',1);                                         % 画出滤波处理后的图像
axis([a3u-c3x,a3d+c3x,b3u-c3y,b3d+c3y]);                                      % 图形的坐标轴范围
title('样本数为200的曲线','color','b');                                        % 图像的标题  

subplot(2,1,2);
p2b = plot(x4,y4,'-r','Linewidth',1);                                         % 画出滤波处理后的图像
axis([a4u-c4x,a4d+c4x,b4u-c4y,b4d+c4y]);                                      % 图形的坐标轴范围
title('样本数为100的曲线','color','b');                                        % 图像的标题  

%% 保存数据
% x1,y1 为样本数800；x2,y2 为样本数400；x3,y3 为样本数200；x4,y4 为样本数100
save('C6d1.mat','x1','y1','x2','y2','x3','y3','x4','y4');                      % 将抽样后的数据保存

%% 设置结束计算时间点0                                                         
tEnd0 = toc(tStart0); 

%% 计时结果输出
disp(' ');
disp('************************************************************');
disp('计时结果输出：');
fprintf('总共用时 ：%d 分 , %f 秒', floor(tEnd0/60), rem(tEnd0,60));            % 程序的总用时间
